## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route.account_1[0] will be created
  + resource "aws_route" "account_1" {
      + destination_cidr_block    = "10.0.0.0/21"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-0e064e7b771507297"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-0771c54d393000439"
    }

  # aws_vpc_peering_connection_accepter.sso_proxy will be created
  + resource "aws_vpc_peering_connection_accepter" "sso_proxy" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + tags                      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Side"       = "Accepter"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Side"       = "Accepter"
          + "Terraform"  = "true"
        }
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = "pcx-0771c54d393000439"

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # aws_vpc_peering_connection_options.sso_proxy will be created
  + resource "aws_vpc_peering_connection_options" "sso_proxy" {
      + id                        = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = false
          + allow_remote_vpc_dns_resolution  = true
          + allow_vpc_to_remote_classic_link = false
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
